# API - Aplication Programing Interface - интерфейс для упроавления данными приложения. 

# HTTP - Hypertext Transfer Protocol протокол(набор правил передачи данных) обмена гипертекста

# Клиент - программа, которая отправляет запросы на сервер (браузер)
# Сервер - программа, которая обрабатывает запросы и отдает ответы клиенту
# Прокси - посредник между клиентами и сервером

# Запрос - обращение к серверу 

""" Методы запроса """ 
# GET - получение данных 
# POST - создание данных 
# PATCH - частичное обновление данных 
# PUT - полное обновление данных 
# DELETE - удаление данных

# HOST - имя сервера. Напрмер - https://sulpak.kg

# URI - Путь до ресурса 
# https://sulpak.kg/f/smartphony/

# Запрос от клиента 
# GET /f/smartfoniy/ HTTPS/1.1

# Ответ от сервера
# HTTPS/1.1 200 ok

# Коды статуса - определенные номера по которым определяют состояние ответа 

# 1xx - информационные 
# 2xx - успешные запросы 
# 3xx - перенаправляющие 
# 4xx - клиентские ошибки 
# 5xx - ошибка на стороне сервере 




